In [1]:
import pandas as pd
import numpy as np

In [2]:
x = pd.DataFrame({
    'id': [1, 2, 3],
    'store_nbr': [1, 2, 3],
    'family': ['Poultry', 'Produce', 'Dairy']
}) #using Dictionary

In [3]:
x

   id  store_nbr   family
0   1          1  Poultry
1   2          2  Produce
2   3          3    Dairy

In [4]:
x.shape

(3, 3)

In [5]:
x.columns

Index(['id', 'store_nbr', 'family'], dtype='object')

In [6]:
x.index

RangeIndex(start=0, stop=3, step=1)

In [7]:
x.dtypes

id            int64
store_nbr     int64
family       object
dtype: object

In [8]:
x.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['id', 'store_nbr', 'family'], dtype='object')]

# create a DataFrame by reading a file

In [25]:
import pandas as pd

In [29]:
df = pd.read_csv("M:\Python\Pandas\DataSets\sample2.csv")

In [30]:
df

          id        date  store_nbr               family  sales  onpromotion
0    1945944  01-01-2016          1           AUTOMOTIVE      0            0
1    1945945  01-01-2016          1            BABY CARE      0            0
2    1945946  01-01-2016          1               BEAUTY      0            0
3    1945947  01-01-2016          1            BEVERAGES      0            0
4    1945948  01-01-2016          1                BOOKS      0            0
..       ...         ...        ...                  ...    ...          ...
444  1946388  01-01-2016         21   HOME AND KITCHEN I      0            0
445  1946389  01-01-2016         21  HOME AND KITCHEN II      0            0
446  1946390  01-01-2016         21      HOME APPLIANCES      0            0
447  1946391  01-01-2016         21            HOME CARE      0            0
448  1946392  01-01-2016         21           LADIESWEAR      0            0

[449 rows x 6 columns]

In [31]:
df.shape

(449, 6)

In [32]:
df.index

RangeIndex(start=0, stop=449, step=1)

In [33]:
df.axes

[RangeIndex(start=0, stop=449, step=1),
 Index(['id', 'date', 'store_nbr', 'family', 'sales', 'onpromotion'], dtype='object')]

In [34]:
df.columns

Index(['id', 'date', 'store_nbr', 'family', 'sales', 'onpromotion'], dtype='object')

In [35]:
df.dtypes

id              int64
date           object
store_nbr       int64
family         object
sales           int64
onpromotion     int64
dtype: object

# Exploring DateFrame
    - df.head() : retuns the n first row of DF (bydefault 5)
        
    - df.tail(): returns the last n row of DF (5 bydefault)
            
    - df.sample(): returns n rows from the random sample (1 bydefault)
        
    - df.info():  returns key details on a DataFrame's size, columns, and memory usage
    
    - df.describe(): returns descriptive statistics for the columns in a DataFrame(only numeric columns)

In [36]:
df.head()

        id        date  store_nbr      family  sales  onpromotion
0  1945944  01-01-2016          1  AUTOMOTIVE      0            0
1  1945945  01-01-2016          1   BABY CARE      0            0
2  1945946  01-01-2016          1      BEAUTY      0            0
3  1945947  01-01-2016          1   BEVERAGES      0            0
4  1945948  01-01-2016          1       BOOKS      0            0

In [37]:
df.head(12)

         id        date  store_nbr        family  sales  onpromotion
0   1945944  01-01-2016          1    AUTOMOTIVE      0            0
1   1945945  01-01-2016          1     BABY CARE      0            0
2   1945946  01-01-2016          1        BEAUTY      0            0
3   1945947  01-01-2016          1     BEVERAGES      0            0
4   1945948  01-01-2016          1         BOOKS      0            0
5   1945949  01-01-2016          1  BREAD/BAKERY      0            0
6   1945950  01-01-2016          1   CELEBRATION      0            0
7   1945951  01-01-2016          1      CLEANING      0            0
8   1945952  01-01-2016          1         DAIRY      0            0
9   1945953  01-01-2016          1          DELI      0            0
10  1945954  01-01-2016          1          EGGS      0            0
11  1945955  01-01-2016          1  FROZEN FOODS      0            0

In [38]:
df.tail()

          id        date  store_nbr               family  sales  onpromotion
444  1946388  01-01-2016         21   HOME AND KITCHEN I      0            0
445  1946389  01-01-2016         21  HOME AND KITCHEN II      0            0
446  1946390  01-01-2016         21      HOME APPLIANCES      0            0
447  1946391  01-01-2016         21            HOME CARE      0            0
448  1946392  01-01-2016         21           LADIESWEAR      0            0

In [40]:
df.tail(2)

          id        date  store_nbr      family  sales  onpromotion
447  1946391  01-01-2016         21   HOME CARE      0            0
448  1946392  01-01-2016         21  LADIESWEAR      0            0

In [41]:
df.sample()

          id        date  store_nbr       family  sales  onpromotion
204  1946148  01-01-2016         15  CELEBRATION      0            0

In [45]:
df.sample(3, random_state=123456)

          id        date  store_nbr        family  sales  onpromotion
323  1946267  01-01-2016         18  PET SUPPLIES      0            0
310  1946254  01-01-2016         18    GROCERY II      0            0
46   1945990  01-01-2016         10    GROCERY II      0            0

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 449 entries, 0 to 448
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           449 non-null    int64
 1   date         449 non-null    object
 2   store_nbr    449 non-null    int64
 3   family       449 non-null    object
 4   sales        449 non-null    int64
 5   onpromotion  449 non-null    int64
dtypes: int64(4), object(2)
memory usage: 21.2+ KB

In [47]:
df.info(show_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 449 entries, 0 to 448
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           449 non-null    int64
 1   date         449 non-null    object
 2   store_nbr    449 non-null    int64
 3   family       449 non-null    object
 4   sales        449 non-null    int64
 5   onpromotion  449 non-null    int64
dtypes: int64(4), object(2)
memory usage: 21.2+ KB

In [49]:
df.isna().sum()

id             0
date           0
store_nbr      0
family         0
sales          0
onpromotion    0
dtype: int64

In [50]:
df.describe()

                 id   store_nbr  sales  onpromotion
count  4.490000e+02  449.000000  449.0        449.0
mean   1.946168e+06   13.282851    0.0          0.0
std    1.297594e+02    5.800069    0.0          0.0
min    1.945944e+06    1.000000    0.0          0.0
25%    1.946056e+06   11.000000    0.0          0.0
50%    1.946168e+06   14.000000    0.0          0.0
75%    1.946280e+06   18.000000    0.0          0.0
max    1.946392e+06   21.000000    0.0          0.0

In [52]:
df.describe(include='all').round()

               id        date  store_nbr      family  sales  onpromotion
count       449.0         449      449.0         449  449.0        449.0
unique        NaN           1        NaN          33    NaN          NaN
top           NaN  01-01-2016        NaN  GROCERY II    NaN          NaN
freq          NaN         449        NaN          14    NaN          NaN
mean    1946168.0         NaN       13.0         NaN    0.0          0.0
std         130.0         NaN        6.0         NaN    0.0          0.0
min     1945944.0         NaN        1.0         NaN    0.0          0.0
25%     1946056.0         NaN       11.0         NaN    0.0          0.0
50%     1946168.0         NaN       14.0         NaN    0.0          0.0
75%     1946280.0         NaN       18.0         NaN    0.0          0.0
max     1946392.0         NaN       21.0         NaN    0.0          0.0

# Access DataFrame Columns:
   by using
   
   - bracket [] or
   - dot notation  // only works for valid Python variable names

In [53]:
df.id

0      1945944
1      1945945
2      1945946
3      1945947
4      1945948
        ...
444    1946388
445    1946389
446    1946390
447    1946391
448    1946392
Name: id, Length: 449, dtype: int64

In [54]:
df['id']

0      1945944
1      1945945
2      1945946
3      1945947
4      1945948
        ...
444    1946388
445    1946389
446    1946390
447    1946391
448    1946392
Name: id, Length: 449, dtype: int64

In [55]:
df.family

0               AUTOMOTIVE
1                BABY CARE
2                   BEAUTY
3                BEVERAGES
4                    BOOKS
              ...
444     HOME AND KITCHEN I
445    HOME AND KITCHEN II
446        HOME APPLIANCES
447              HOME CARE
448             LADIESWEAR
Name: family, Length: 449, dtype: object

In [57]:
df['family'].nunique()

33

In [58]:
#find first five unique values in columns with their frequencies

df['family'].value_counts().iloc[:5]

GROCERY II         14
BEAUTY             14
HOME APPLIANCES    14
LADIESWEAR         14
FROZEN FOODS       14
Name: family, dtype: int64

In [66]:
#mean of the values in columns

df.id.mean()

1946168.0

In [60]:
df['sales'].mean()

0.0

In [61]:
df['id'].mean()

1946168.0

In [63]:
df.id.mean()

1946168.0

In [65]:
df.id.sum().round()

873829432

In [72]:
df[['id', 'family']]

          id               family
0    1945944           AUTOMOTIVE
1    1945945            BABY CARE
2    1945946               BEAUTY
3    1945947            BEVERAGES
4    1945948                BOOKS
..       ...                  ...
444  1946388   HOME AND KITCHEN I
445  1946389  HOME AND KITCHEN II
446  1946390      HOME APPLIANCES
447  1946391            HOME CARE
448  1946392           LADIESWEAR

[449 rows x 2 columns]

In [77]:
df[['id', 'sales']].mean().round()

id       1946168.0
sales          0.0
dtype: float64

In [83]:
df.iloc[:5, :3]

        id        date  store_nbr
0  1945944  01-01-2016          1
1  1945945  01-01-2016          1
2  1945946  01-01-2016          1
3  1945947  01-01-2016          1
4  1945948  01-01-2016          1

In [84]:
df.iloc[:, :3]

          id        date  store_nbr
0    1945944  01-01-2016          1
1    1945945  01-01-2016          1
2    1945946  01-01-2016          1
3    1945947  01-01-2016          1
4    1945948  01-01-2016          1
..       ...         ...        ...
444  1946388  01-01-2016         21
445  1946389  01-01-2016         21
446  1946390  01-01-2016         21
447  1946391  01-01-2016         21
448  1946392  01-01-2016         21

[449 rows x 3 columns]

In [85]:
df.iloc[2:5, 1:3]

         date  store_nbr
2  01-01-2016          1
3  01-01-2016          1
4  01-01-2016          1

In [91]:
df.loc[:, 'family']

0               AUTOMOTIVE
1                BABY CARE
2                   BEAUTY
3                BEVERAGES
4                    BOOKS
              ...
444     HOME AND KITCHEN I
445    HOME AND KITCHEN II
446        HOME APPLIANCES
447              HOME CARE
448             LADIESWEAR
Name: family, Length: 449, dtype: object

In [92]:
df.loc[:, ['date']]

           date
0    01-01-2016
1    01-01-2016
2    01-01-2016
3    01-01-2016
4    01-01-2016
..          ...
444  01-01-2016
445  01-01-2016
446  01-01-2016
447  01-01-2016
448  01-01-2016

[449 rows x 1 columns]

In [93]:
df.loc[:, ['date', 'family']]

           date               family
0    01-01-2016           AUTOMOTIVE
1    01-01-2016            BABY CARE
2    01-01-2016               BEAUTY
3    01-01-2016            BEVERAGES
4    01-01-2016                BOOKS
..          ...                  ...
444  01-01-2016   HOME AND KITCHEN I
445  01-01-2016  HOME AND KITCHEN II
446  01-01-2016      HOME APPLIANCES
447  01-01-2016            HOME CARE
448  01-01-2016           LADIESWEAR

[449 rows x 2 columns]

In [97]:
df.loc[:, 'date':'sales']

           date  store_nbr               family  sales
0    01-01-2016          1           AUTOMOTIVE      0
1    01-01-2016          1            BABY CARE      0
2    01-01-2016          1               BEAUTY      0
3    01-01-2016          1            BEVERAGES      0
4    01-01-2016          1                BOOKS      0
..          ...        ...                  ...    ...
444  01-01-2016         21   HOME AND KITCHEN I      0
445  01-01-2016         21  HOME AND KITCHEN II      0
446  01-01-2016         21      HOME APPLIANCES      0
447  01-01-2016         21            HOME CARE      0
448  01-01-2016         21           LADIESWEAR      0

[449 rows x 4 columns]

# Dropping Rows & Columns
   
   Specify:
    
   axis = 0, drop rows by label
   
   axis = 1, drop column by label

In [98]:
df.head(10)

        id        date  store_nbr        family  sales  onpromotion
0  1945944  01-01-2016          1    AUTOMOTIVE      0            0
1  1945945  01-01-2016          1     BABY CARE      0            0
2  1945946  01-01-2016          1        BEAUTY      0            0
3  1945947  01-01-2016          1     BEVERAGES      0            0
4  1945948  01-01-2016          1         BOOKS      0            0
5  1945949  01-01-2016          1  BREAD/BAKERY      0            0
6  1945950  01-01-2016          1   CELEBRATION      0            0
7  1945951  01-01-2016          1      CLEANING      0            0
8  1945952  01-01-2016          1         DAIRY      0            0
9  1945953  01-01-2016          1          DELI      0            0

In [102]:
df.drop('id', axis = 1).head(10)

         date  store_nbr        family  sales  onpromotion
0  01-01-2016          1    AUTOMOTIVE      0            0
1  01-01-2016          1     BABY CARE      0            0
2  01-01-2016          1        BEAUTY      0            0
3  01-01-2016          1     BEVERAGES      0            0
4  01-01-2016          1         BOOKS      0            0
5  01-01-2016          1  BREAD/BAKERY      0            0
6  01-01-2016          1   CELEBRATION      0            0
7  01-01-2016          1      CLEANING      0            0
8  01-01-2016          1         DAIRY      0            0
9  01-01-2016          1          DELI      0            0

In [104]:
df.drop('sales', axis=1, inplace=True)

In [105]:
df.head()

        id        date  store_nbr      family  onpromotion
0  1945944  01-01-2016          1  AUTOMOTIVE            0
1  1945945  01-01-2016          1   BABY CARE            0
2  1945946  01-01-2016          1      BEAUTY            0
3  1945947  01-01-2016          1   BEVERAGES            0
4  1945948  01-01-2016          1       BOOKS            0

In [109]:
df.drop([3], axis = 0).head()

        id        date  store_nbr        family  onpromotion
0  1945944  01-01-2016          1    AUTOMOTIVE            0
1  1945945  01-01-2016          1     BABY CARE            0
2  1945946  01-01-2016          1        BEAUTY            0
4  1945948  01-01-2016          1         BOOKS            0
5  1945949  01-01-2016          1  BREAD/BAKERY            0

In [110]:
df.drop(range(5), axis = 0).head()

        id        date  store_nbr        family  onpromotion
5  1945949  01-01-2016          1  BREAD/BAKERY            0
6  1945950  01-01-2016          1   CELEBRATION            0
7  1945951  01-01-2016          1      CLEANING            0
8  1945952  01-01-2016          1         DAIRY            0
9  1945953  01-01-2016          1          DELI            0

# Identifying Duplicate Rows
     Specify 'subset = column(s)' to look for duplicate accross a subsets of columns

In [121]:
pdf = pd.DataFrame(
{
    "product": ['Dairy', 'Dairy', 'Dairy', 'Vegetables', 'Fruits'],
    "price":[2.56, 2.56, 4.55, 2.74, 5.44]
})
pdf

      product  price
0       Dairy   2.56
1       Dairy   2.56
2       Dairy   4.55
3  Vegetables   2.74
4      Fruits   5.44

In [125]:
pdf.shape

(5, 2)

In [126]:
pdf.nunique()

product    3
price      4
dtype: int64

In [127]:
pdf.duplicated()

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [128]:
pdf.duplicated(subset = 'product')

0    False
1     True
2     True
3    False
4    False
dtype: bool

In [129]:
#Drop Duplicate row
pdf.drop_duplicates()

      product  price
0       Dairy   2.56
2       Dairy   4.55
3  Vegetables   2.74
4      Fruits   5.44

In [133]:
pdf.drop_duplicates(subset='product', keep='last', ignore_index = True)

      product  price
0       Dairy   4.55
1  Vegetables   2.74
2      Fruits   5.44